------------------------------------------------------------------------------------------------------<br>
<h3 style="background:#87a1c2; color:#ffffff; padding:20px; border-radius:5px;">✍ TITANIC DATASET - PANDAS</h3><br>
------------------------------------------------------------------------------------------------------<br>

<b>BREVE EXPLICACIÓN DEL DATASET:</b><br>
<img src="img/titanic.png">
<img src="img/titanic2.png">

<b>DESCRIPCIÓN DE LAS VARIABLES:</b><br><br>
1.- Survived (0 = No; 1 = Yes): <b>Supervivientes</b><br> 
2.- Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd): <b>Clase</b><br> 
3.- Name: <b>Nombre</b><br>
4.- Sex: <b>Sexo</b><br>
5.- Age: <b>Edad</b><br>
6.- Number of Siblings/Spouses: <b>Hermanos/Cónyuges</b><br>
7.- Number of Parents/Children: <b>Padres/Hijos</b><br>
8.- Ticket: <b>Ticket</b><br>
9.- Passenger Fare: <b>Tarifa de pasajero</b><br>
10.- Cabin: <b>Cabina</b><br>
11.- Embarked (C = Cherbourg; Q = Queenstown; S = Southampton): <b>Embarcado</b><br><br>

In [5]:
import numpy as np
import pandas as pd

#LEER EL csv
df = pd.read_csv('dataset/02_titanic.csv')
#ESCRIBIR LAS PRIMERAS 5 FILAS
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
# Primer repaso, tipo de dato
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
# Datos faltantes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
# Breve descfipción, igual nos sirve para detectar algun Outlier, quién sabe
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [11]:
# Columnas
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [12]:
# Descripción target
df.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [13]:
# Target por cada clase, bueno no es que aporte mucho valor en este caso
df.groupby('Survived').count()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Survived,,,,,,,,,,,
0,549,549,549,549,424,549,549,549,549,68,549
1,342,342,342,342,290,342,342,342,342,136,340

In [14]:
# Otra manera con el añadido del método name
df.groupby('Survived').count().Name

Survived
0    549
1    342
Name: Name, dtype: int64

In [15]:
# comparativas y agrupaciones. Estamos haciendo estadística descriptiva en tablas
df.groupby(['Survived','Sex']).count()

                 PassengerId  Pclass  Name  Age  SibSp  Parch  Ticket  Fare  \
Survived Sex
0        female           81      81    81   64     81     81      81    81
         male            468     468   468  360    468    468     468   468
1        female          233     233   233  197    233    233     233   233
         male            109     109   109   93    109    109     109   109

                 Cabin  Embarked
Survived Sex
0        female      6        81
         male       62       468
1        female     91       231
         male       45       109

In [16]:
# Parece que el sexo influyó
df.groupby(['Survived','Sex']).count().Name

Survived  Sex
0         female     81
          male      468
1         female    233
          male      109
Name: Name, dtype: int64

In [17]:
print ("Supervivencia femenina: %", 233/(233+81))
print ("Supervivencia masculina: %", 109/(109+468))

Supervivencia femenina: % 0.7420382165605095
Supervivencia masculina: % 0.18890814558058924

In [18]:
# Análisis por parentesco
df.groupby(['Survived','Parch']).count().Name

Survived  Parch
0         0        445
          1         53
          2         40
          3          2
          4          4
          5          4
          6          1
1         0        233
          1         65
          2         40
          3          3
          5          1
Name: Name, dtype: int64

In [19]:
print ("Supervivencia sin padres/hijos: %", 233/(233+445))
print ("Supervivencia con 1 padre/hijo: %", 65/(65+53))
print ("Supervivencia con 2 padres/hijos: %", 40/(40+40))

Supervivencia sin padres/hijos: % 0.34365781710914456
Supervivencia con 1 padre/hijo: % 0.5508474576271186
Supervivencia con 2 padres/hijos: % 0.5

In [20]:
# Análisis por clase
df.groupby(['Survived','Pclass']).count().Name

Survived  Pclass
0         1          80
          2          97
          3         372
1         1         136
          2          87
          3         119
Name: Name, dtype: int64

In [21]:
print ("Supervivencia 1ra clase: %", 136/(136+80))
print ("Supervivencia 2da clase: %", 87/(87+97))
print ("Supervivencia 3ra clase: %", 119/(119+372))

Supervivencia 1ra clase: % 0.6296296296296297
Supervivencia 2da clase: % 0.47282608695652173
Supervivencia 3ra clase: % 0.24236252545824846

In [22]:
# Búsqueda de valores nulos
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [23]:
# Eliminación
del df['Cabin']

In [24]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [25]:
del df['Age']

In [26]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [27]:
# Rellenando valores nulos usando fillna ()
df["Embarked"].fillna("Aleatorio", inplace = True)

In [28]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [29]:
df['Embarked'].unique()

array(['S', 'C', 'Q', 'Aleatorio'], dtype=object)

In [30]:
len(df['Embarked'].unique())

4

In [31]:
df['Embarked'].value_counts()

S            644
C            168
Q             77
Aleatorio      2
Name: Embarked, dtype: int64

In [32]:
df = df.drop(df[df['Embarked']=='Aleatorio'].index)

In [33]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [34]:
#Convertir a numérico. Las compus sólo entienden números
df['Embarked']=df['Embarked'].replace(['S','C','Q'],[0,1,2])

In [35]:
# Convertir a numérico
df['Sex']=df['Sex'].replace(['female','male'],[0,1])

In [36]:
# Otro modo de borrar
df.drop('Name', inplace=True, axis=1)

In [37]:
del df['Ticket']

In [38]:
df.head()

   PassengerId  Survived  Pclass  Sex  SibSp  Parch     Fare  Embarked
0            1         0       3    1      1      0   7.2500         0
1            2         1       1    0      1      0  71.2833         1
2            3         1       3    0      0      0   7.9250         0
3            4         1       1    0      1      0  53.1000         0
4            5         0       3    1      0      0   8.0500         0

In [39]:
df[df['Fare']==df['Fare'].max()]

     PassengerId  Survived  Pclass  Sex  SibSp  Parch      Fare  Embarked
258          259         1       1    0      0      0  512.3292         1
679          680         1       1    1      0      1  512.3292         1
737          738         1       1    1      0      0  512.3292         1

In [40]:
print (df['Fare'].max())

512.3292

In [41]:
df[df['Fare']==df['Fare'].min()]

     PassengerId  Survived  Pclass  Sex  SibSp  Parch  Fare  Embarked
179          180         0       3    1      0      0   0.0         0
263          264         0       1    1      0      0   0.0         0
271          272         1       3    1      0      0   0.0         0
277          278         0       2    1      0      0   0.0         0
302          303         0       3    1      0      0   0.0         0
413          414         0       2    1      0      0   0.0         0
466          467         0       2    1      0      0   0.0         0
481          482         0       2    1      0      0   0.0         0
597          598         0       3    1      0      0   0.0         0
633          634         0       1    1      0      0   0.0         0
674          675         0       2    1      0      0   0.0         0
732          733         0       2    1      0      0   0.0         0
806          807         0       1    1      0      0   0.0         0
815          816         0       1    1      0      0   0.0         0
822          823         0       1    1      0      0   0.0         0

In [42]:
print (df['Fare'].mean())

32.09668087739029

In [43]:
# Borrar 2 columnas. Opto por borrar Fare, es una decisión acertada? Ya lo veremos. Borro también PassengerId, evidentemente
df = df.drop(['PassengerId','Fare'], axis=1)

In [46]:
df.corr()

          Survived    Pclass       Sex     SibSp     Parch  Embarked
Survived  1.000000 -0.335549 -0.541585 -0.034040  0.083151  0.108669
Pclass   -0.335549  1.000000  0.127741  0.081656  0.016824  0.043835
Sex      -0.541585  0.127741  1.000000 -0.116348 -0.247508 -0.118593
SibSp    -0.034040  0.081656 -0.116348  1.000000  0.414542 -0.060606
Parch     0.083151  0.016824 -0.247508  0.414542  1.000000 -0.079320
Embarked  0.108669  0.043835 -0.118593 -0.060606 -0.079320  1.000000

In [44]:
df.head()

   Survived  Pclass  Sex  SibSp  Parch  Embarked
0         0       3    1      1      0         0
1         1       1    0      1      0         1
2         1       3    0      0      0         0
3         1       1    0      1      0         0
4         0       3    1      0      0         0

In [45]:
# Convertir el DataFrame final en csv para descargar.
df.to_csv(r'dataset\02_titanic_manipulado.csv', index = False)

<h3>👏👏👏 You guys rock !!!</h3>